In [26]:
import pandas as pd

In [57]:
# Question 18

#For this question, you need a specific package or library to grab data form the web.
# use the follwing command to install the package
#In the command line window, type "conda install pandas-datareader" or 
#"Pip install pandas-datareader"
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'

In [28]:
all_data ={ticker: web.get_data_yahoo(ticker)
          for ticker in ['SPY', 'GLD', 'SLV', 'USO', 'UUP']}

NameError: name 'web' is not defined

In [29]:
price=pd.DataFrame({ticker:data['Adj Close']
                  for ticker, data in all_data.items()})

NameError: name 'all_data' is not defined

In [30]:
returns=price.pct_change()

NameError: name 'price' is not defined

In [31]:
returns.corr()

NameError: name 'returns' is not defined

In [32]:
#silver and gold have the strongest relationship in terms of being positively related.
#

In [33]:
#Question 1
Grades= pd.Series([90,85,79,92,93], index =['Jack','Joan','Max','Mike','Kevin'])
Grades.index.name='Name'
Grades.name ='Exam Grades'
Grades

Name
Jack     90
Joan     85
Max      79
Mike     92
Kevin    93
Name: Exam Grades, dtype: int64

In [34]:
#Question 2
Grades.min()

79

In [35]:
Grades.max()

93

In [36]:
Grades.mean()

87.8

In [37]:
#question 3
Grades[Grades>=Grades.mean()]

Name
Jack     90
Mike     92
Kevin    93
Name: Exam Grades, dtype: int64

In [38]:
#question 4
Grades[['Joan', 'Jack']]

Name
Joan    85
Jack    90
Name: Exam Grades, dtype: int64

In [39]:
#Question 5
Grades['Joan']=95
Grades

Name
Jack     90
Joan     95
Max      79
Mike     92
Kevin    93
Name: Exam Grades, dtype: int64

In [40]:
#question 6
Data={'Q1':[1200,1300,1100],
        'Q2':[1400,1500,1200],
          'Q3':[800,1600,1000],
          'Q4':[1100,1000,1050]}
frame=pd.DataFrame(Data, index=['Dallas', 'Houston','Austin'])
frame

           Q1    Q2    Q3    Q4
Dallas   1200  1400   800  1100
Houston  1300  1500  1600  1000
Austin   1100  1200  1000  1050

In [41]:
#question 7
frame['Q3']

Dallas      800
Houston    1600
Austin     1000
Name: Q3, dtype: int64

In [42]:
frame.loc['Houston']

Q1    1300
Q2    1500
Q3    1600
Q4    1000
Name: Houston, dtype: int64

In [43]:
#Question 8
frame.index.name='city'; frame.columns.name='Quarter'
frame['Total']=frame.sum(axis=1).astype(int)
frame

Quarter    Q1    Q2    Q3    Q4  Total
city
Dallas   1200  1400   800  1100   4500
Houston  1300  1500  1600  1000   5400
Austin   1100  1200  1000  1050   4350

In [44]:
#Question 9
frame.values

array([[1200, 1400,  800, 1100, 4500],
       [1300, 1500, 1600, 1000, 5400],
       [1100, 1200, 1000, 1050, 4350]], dtype=int64)

In [45]:
frame.index

Index(['Dallas', 'Houston', 'Austin'], dtype='object', name='city')

In [46]:
frame.columns

Index(['Q1', 'Q2', 'Q3', 'Q4', 'Total'], dtype='object', name='Quarter')

In [47]:
#Question 10
frame2=frame.reindex(['Austin','Dallas','Houston'])
frame2

Quarter    Q1    Q2    Q3    Q4  Total
city
Austin   1100  1200  1000  1050   4350
Dallas   1200  1400   800  1100   4500
Houston  1300  1500  1600  1000   5400

In [48]:
#Question 11 
# Question 12 is below Question 14
frame[['Q2','Q3']]

Quarter    Q2    Q3
city
Dallas   1400   800
Houston  1500  1600
Austin   1200  1000

In [49]:
#question 12
frame[frame['Q3']>=1000]

Quarter    Q1    Q2    Q3    Q4  Total
city
Houston  1300  1500  1600  1000   5400
Austin   1100  1200  1000  1050   4350

In [50]:
#Question 13
frame.sort_index(ascending=False)

Quarter    Q1    Q2    Q3    Q4  Total
city
Houston  1300  1500  1600  1000   5400
Dallas   1200  1400   800  1100   4500
Austin   1100  1200  1000  1050   4350

In [51]:
#Question 14
frame.sort_index(ascending=False)
frame['Average']=frame[['Q1','Q2','Q3','Q4']].mean(axis=1)
frame

Quarter    Q1    Q2    Q3    Q4  Total  Average
city
Dallas   1200  1400   800  1100   4500   1125.0
Houston  1300  1500  1600  1000   5400   1350.0
Austin   1100  1200  1000  1050   4350   1087.5

In [52]:
#Question 15
frame.drop(['Total','Average'],axis='columns',inplace=True)
frame

Quarter    Q1    Q2    Q3    Q4
city
Dallas   1200  1400   800  1100
Houston  1300  1500  1600  1000
Austin   1100  1200  1000  1050

In [53]:
frame.loc['San antonio'] = [1150,1200,900,1000]
frame

Quarter        Q1    Q2    Q3    Q4
city
Dallas       1200  1400   800  1100
Houston      1300  1500  1600  1000
Austin       1100  1200  1000  1050
San antonio  1150  1200   900  1000

In [54]:
#question 16
frame.T

city     Dallas  Houston  Austin  San antonio
Quarter
Q1         1200     1300    1100         1150
Q2         1400     1500    1200         1200
Q3          800     1600    1000          900
Q4         1100     1000    1050         1000

In [55]:
#question 17
frame.describe()

Quarter           Q1      Q2           Q3           Q4
count       4.000000     4.0     4.000000     4.000000
mean     1187.500000  1325.0  1075.000000  1037.500000
std        85.391256   150.0   359.397644    47.871355
min      1100.000000  1200.0   800.000000  1000.000000
25%      1137.500000  1200.0   875.000000  1000.000000
50%      1175.000000  1300.0   950.000000  1025.000000
75%      1225.000000  1425.0  1150.000000  1062.500000
max      1300.000000  1500.0  1600.000000  1100.000000